identification division.
program-id. corpus-copybook.
data division.
working-storage section.
copy "hello.cpy".
procedure division.
 display greeting-text
 goback.
